[
  {
    "id": "hard-001",
    "title": "Мини-банк: сравнение ипотек с досрочным погашением по сценариям",
    "description": "Веб-сервис, который сравнивает ипотечные предложения 5 банков и умеет моделировать досрочные платежи (фиксированная сумма/процент от дохода) с пересчетом срока и переплаты.",
    "acceptance_criteria": [
      "Есть каталог минимум 5 банков с параметрами: ставка, первоначальный взнос, комиссии, возможность досрочного",
      "Пользователь задаёт сумму, срок, взнос и сценарий досрочного погашения (2 типа минимум)",
      "Сервис строит график платежей и показывает итоговую переплату и дату закрытия кредита",
      "Есть сравнение банков в таблице по итоговой переплате и сроку закрытия с учетом досрочного"
    ]
  },
  {
    "id": "hard-002",
    "title": "Трекер подписок с автоматической категоризацией и бюджетными правилами",
    "description": "Сервис учета подписок с правилами оптимизации: лимиты по категориям, авто-предложения (отключить/понизить/заменить) и история изменений.",
    "acceptance_criteria": [
      "Поддерживается CRUD подписок с полями: цена, период, категория, важность, альтернатива (опционально)",
      "Есть лимиты по категориям и общий лимит на месяц, лимиты сохраняются по пользователю",
      "Сервис генерирует план оптимизации минимум из 5 шагов с расчетом экономии по шагам",
      "Есть история изменений подписок и отчет 'расходы по месяцам' минимум за 3 месяца (на тестовых данных)"
    ]
  },
  {
    "id": "hard-003",
    "title": "Планировщик питания: меню на неделю + корзина покупок + исключения",
    "description": "Сервис планирования меню на неделю с автоматической сборкой корзины продуктов, учетом аллергенов/исключений и пересчетом количеств.",
    "acceptance_criteria": [
      "Есть каталог минимум 50 рецептов, каждый с ингредиентами и граммовками",
      "Пользователь формирует меню на 7 дней (минимум 2 приема пищи в день)",
      "Сервис строит агрегированную корзину покупок с суммарными количествами по ингредиентам",
      "Есть настройка исключений (аллергены) и автоматическая замена/удаление рецептов с пересчетом корзины"
    ]
  },
  {
    "id": "hard-004",
    "title": "Сервис сравнения вкладов с капитализацией и пополнениями",
    "description": "Финансовый калькулятор вкладов, который считает итоговую сумму с капитализацией, регулярными пополнениями и частичным снятием.",
    "acceptance_criteria": [
      "Есть минимум 10 вкладов с параметрами: ставка, капитализация (период), пополнение (да/нет), снятие (да/нет)",
      "Пользователь задаёт сумму, срок, график пополнений и при необходимости график снятий",
      "Сервис рассчитывает итоговую сумму и эффективную доходность для каждого вклада",
      "Результат: таблица топ-5 вкладов по итоговой сумме с раскрытием расчетных параметров"
    ]
  },
  {
    "id": "hard-005",
    "title": "Сервис выбора банковской карты по структуре расходов и ограничениям",
    "description": "Сервис, который рассчитывает чистую выгоду по картам с учетом категорий кэшбэка, лимитов, исключений и стоимости обслуживания.",
    "acceptance_criteria": [
      "Есть минимум 15 карт с правилами: категории %, лимиты, исключения, обслуживание",
      "Пользователь вводит расходы минимум по 10 категориям и указывает желаемые ограничения (например, без платного обслуживания)",
      "Сервис считает ожидаемую чистую выгоду по каждой карте (кэшбэк - обслуживание - потери из-за лимитов)",
      "Показывается топ-5 карт и детализация расчета по выбранной карте"
    ]
  },
  {
    "id": "hard-006",
    "title": "Планировщик накоплений на несколько целей с оптимизацией распределения",
    "description": "Сервис, который распределяет ежемесячный бюджет на накопления между целями, минимизируя риск недостижения сроков (приоритеты/штрафы).",
    "acceptance_criteria": [
      "Можно создать минимум 5 целей с суммой, сроком и приоритетом/штрафом за недостижение",
      "Пользователь задаёт ежемесячный бюджет и дату старта",
      "Сервис предлагает план распределения по месяцам минимум на 12 месяцев вперед",
      "Есть отчет: какие цели достигаются в срок, какие нет, и на сколько месяцев/рублей отклонение"
    ]
  },
  {
    "id": "hard-007",
    "title": "Сервис сравнения эквайринга для малого бизнеса по реальным сценариям",
    "description": "Сервис, который считает итоговые комиссии эквайринга с учетом оборота, среднего чека, возвратов и минимальных платежей.",
    "acceptance_criteria": [
      "Поля ввода: оборот, средний чек, доля возвратов, доля онлайн/офлайн",
      "Есть минимум 6 провайдеров с разными тарифными правилами и минимальными платежами",
      "Сервис рассчитывает итоговую стоимость эквайринга за месяц по каждому провайдеру",
      "Результат: таблица с итогом, эффективной комиссией и топ-3 рекомендациями"
    ]
  },
  {
    "id": "hard-008",
    "title": "Сервис учета домашних платежей с напоминаниями и задолженностью",
    "description": "Сервис учета счетов (ЖКХ/интернет/кредиты) с календарем оплат, отметками платежей и расчетом просрочек.",
    "acceptance_criteria": [
      "Можно создавать обязательства с периодичностью, суммой и датой платежа",
      "Есть календарь платежей на месяц с фильтром по типу",
      "Можно отмечать платежи как оплаченные, хранится история",
      "Сервис показывает список просроченных платежей и сумму задолженности"
    ]
  },
  {
    "id": "hard-009",
    "title": "Сервис расчета стоимости ремонта с этапами, подрядчиками и рисками",
    "description": "Планировщик ремонта: этапы, сметы, подрядчики, контроль превышений и буфер на риски.",
    "acceptance_criteria": [
      "Есть минимум 6 этапов ремонта, каждому задается плановый бюджет и подрядчик",
      "Можно вносить фактические расходы с привязкой к этапу и статье",
      "Сервис показывает план/факт по этапам и общий перерасход",
      "Есть настройка 'буфер на риски' (%) и пересчет допустимых лимитов по этапам"
    ]
  },
  {
    "id": "hard-010",
    "title": "Сервис планирования командировок: лимиты, согласование, отчет",
    "description": "Сервис для сотрудника и менеджера: планирование командировки, лимиты, согласование, учет фактических расходов и отчет.",
    "acceptance_criteria": [
      "Роли: сотрудник и согласующий; у согласующего есть список заявок на командировки",
      "Сотрудник создает командировку с плановыми расходами по категориям и приложениями (файлы/ссылки)",
      "Согласующий утверждает/отклоняет с комментарием, статус меняется",
      "Формируется отчет план/факт по завершении командировки и экспорт в CSV"
    ]
  },

  {
    "id": "hard-011",
    "title": "Сервис-деск: заявки, статусы, SLA, эскалации",
    "description": "Мини-сервис-деск для ИТ-поддержки: создание заявок, маршрутизация по категориям, SLA по приоритетам, авто-эскалации.",
    "acceptance_criteria": [
      "Роли: пользователь, оператор, админ; разграничение доступа к заявкам",
      "Категории и приоритеты; SLA по реакции и решению настраивается админом",
      "Авто-эскалация: если SLA реакции нарушен, заявка переходит в статус 'эскалация' и назначается старшему",
      "Есть дашборд: % соблюдения SLA по неделям и топ-5 причин обращений (по категориям)"
    ]
  },
  {
    "id": "hard-012",
    "title": "Оценка качества ответов поддержки по чек-листу + рейтинг операторов",
    "description": "Сервис оценки качества обращений: чек-листы, выборка обращений, подсчет рейтинга и трендов по операторам.",
    "acceptance_criteria": [
      "Есть чек-лист минимум из 8 критериев с весами (настраиваемо)",
      "Можно оценить обращение, привязав к оператору и типу обращения",
      "Сервис считает рейтинг оператора за период и показывает динамику по неделям",
      "Есть отчет: топ-10 операторов и список слабых критериев по каждому"
    ]
  },
  {
    "id": "hard-013",
    "title": "Сервис контроля доступов: заявки на доступ + согласование + срок действия",
    "description": "Клиентский сервис для запроса доступов: сотрудник подает заявку, согласующие утверждают, доступ выдается на срок и автоматически истекает.",
    "acceptance_criteria": [
      "Роли: заявитель, согласующий, админ; маршрут согласования задается правилами",
      "Заявка содержит ресурс, роль доступа и срок действия (дата окончания)",
      "По окончании срока доступ автоматически переводится в статус 'истек'",
      "Есть журнал: кто запросил, кто согласовал, когда выдан и когда истек"
    ]
  },
  {
    "id": "hard-014",
    "title": "Каталог внутренних сервисов компании с владельцами и SLA",
    "description": "Каталог внутренних сервисов: описание, владелец, контакты поддержки, SLA, форма обращения.",
    "acceptance_criteria": [
      "Есть CRUD сервисов с полями: владелец, контакты, SLA реакция/решение, категория",
      "Есть поиск и фильтры по категории и владельцу",
      "Есть страница сервиса с кнопкой 'создать обращение' (создает тикет в встроенном трекере)",
      "Есть отчет: количество обращений по сервису за период"
    ]
  },
  {
    "id": "hard-015",
    "title": "Сервис аналитики обращений: причины, тренды, сезонность",
    "description": "Сервис, который по данным тикетов строит аналитику причин обращений и тренды по времени.",
    "acceptance_criteria": [
      "Импорт тикетов из CSV (тема, категория, дата, статус, приоритет)",
      "Сервис строит график обращений по дням/неделям и топ-10 категорий",
      "Есть фильтры по приоритету, сервису, статусу",
      "Можно скачать отчет в CSV: топ категорий + динамика"
    ]
  },
  {
    "id": "hard-016",
    "title": "Планировщик дежурств с ограничениями и проверкой конфликтов",
    "description": "Сервис составления расписания дежурств на месяц с ограничениями (недоступные дни, лимит дежурств, запрет подряд).",
    "acceptance_criteria": [
      "Можно задать недоступные дни для каждого сотрудника и лимит дежурств в месяц",
      "Генерация расписания на месяц с учетом ограничений",
      "Сервис выводит список конфликтов, если расписание невозможно",
      "Есть экспорт расписания в CSV и просмотр в календаре"
    ]
  },
  {
    "id": "hard-017",
    "title": "Сервис учета оборудования: склад, выдача, возврат, инциденты",
    "description": "Сервис учета оборудования с движением, ответственными, инцидентами (поломка/утеря) и отчетами.",
    "acceptance_criteria": [
      "Инвентаризация: CRUD оборудования с уникальным номером и состоянием",
      "Выдача/возврат сотруднику с датой и ответственным, хранится история операций",
      "Можно зарегистрировать инцидент по оборудованию (тип, описание, статус)",
      "Есть отчет: оборудование по статусам и список проблемного оборудования"
    ]
  },
  {
    "id": "hard-018",
    "title": "Сервис учета времени по задачам с утверждением руководителем",
    "description": "Timesheet-сервис: сотрудник заполняет время по проектам, руководитель утверждает, формируются отчеты.",
    "acceptance_criteria": [
      "Роли: сотрудник и руководитель; руководитель видит записи своей команды",
      "Сотрудник создает записи времени с датой, проектом, задачей и часами",
      "Руководитель утверждает/отклоняет с комментарием, статус хранится",
      "Есть отчет по неделям: часы по проектам и топ-5 задач по времени"
    ]
  },
  {
    "id": "hard-019",
    "title": "Сервис сравнения тарифов домашнего интернета по адресу",
    "description": "Сервис подбора интернет-тарифа по адресу с учетом требований (скорость, цена, ТВ, роутер).",
    "acceptance_criteria": [
      "Есть база тарифов минимум 30 штук с привязкой к районам/зонам покрытия (на тест-данных)",
      "Пользователь вводит адрес (район) и требования: скорость, бюджет, ТВ (да/нет)",
      "Сервис фильтрует недоступные по зоне и сортирует по итоговой цене",
      "Показывается топ-5 предложений и детализация: цена, скорость, условия"
    ]
  },
  {
    "id": "hard-020",
    "title": "Сервис сравнения доставки посылок с оптимизацией по цене/сроку",
    "description": "Сервис, который сравнивает доставку у разных провайдеров и предлагает лучший вариант по цене или сроку (выбор пользователем).",
    "acceptance_criteria": [
      "Поля ввода: вес, габариты, города, желаемая дата доставки",
      "Есть минимум 5 провайдеров с разными тарифами и сроками",
      "Пользователь выбирает критерий оптимизации: 'дешевле' или 'быстрее'",
      "Выводится ранжированный список, показывающий цену, срок, ограничения"
    ]
  },

  {
    "id": "hard-021",
    "title": "Сервис сравнения покупки авто: кредит, лизинг, наличные",
    "description": "Сервис сравнения способов приобретения авто, учитывающий платежи, страховки и обслуживание за 3 года.",
    "acceptance_criteria": [
      "Пользователь вводит цену авто, срок, первоначальный взнос и годовой пробег",
      "Есть 3 сценария: наличные, кредит со ставкой, лизинг с удорожанием",
      "Сервис считает общую стоимость владения за 3 года (платежи+страховка+обслуживание+топливо)",
      "Результат: таблица сравнения и лучший сценарий по общей стоимости"
    ]
  },
  {
    "id": "hard-022",
    "title": "Сервис «умная корзина» продуктов с заменами под бюджет",
    "description": "Сервис, который собирает корзину продуктов и при превышении бюджета предлагает замены (дешевле) внутри категории.",
    "acceptance_criteria": [
      "Есть каталог минимум 200 продуктов с ценой, категорией и 'аналогами'",
      "Пользователь добавляет продукты в корзину и задаёт бюджет",
      "При превышении бюджета сервис предлагает минимум 5 замен с указанием экономии",
      "После выбора замен корзина пересчитывается и показывает итоговую сумму"
    ]
  },
  {
    "id": "hard-023",
    "title": "Сервис планирования поездки: маршрут + бюджет + чек-лист",
    "description": "Сервис, который собирает план поездки: города/даты, бюджет по категориям, чек-лист вещей и расходов по дням.",
    "acceptance_criteria": [
      "Пользователь задаёт города и даты (минимум 3 точки маршрута)",
      "Есть план расходов по категориям и по дням с итогами",
      "Есть чек-лист вещей с отметками и возможностью добавления пунктов",
      "Есть экспорт плана поездки в PDF или HTML-страницу (одним файлом)"
    ]
  },
  {
    "id": "hard-024",
    "title": "Сервис управления очередью задач поддержки (канбан) с WIP-лимитами",
    "description": "Канбан-доска для обработки тикетов поддержки с WIP-лимитами по колонкам и уведомлением о превышении.",
    "acceptance_criteria": [
      "Колонки: 'новые', 'в работе', 'ожидает', 'готово' (настраиваемые)",
      "WIP-лимит задается для минимум 2 колонок, при превышении показывается предупреждение",
      "Есть перетаскивание тикетов между колонками и история перемещений",
      "Есть отчет: среднее время в каждой колонке за период"
    ]
  },
  {
    "id": "hard-025",
    "title": "Сервис мониторинга бизнес-SLA: отчеты и уведомления",
    "description": "Сервис, который считает бизнес-SLA по обращениям/заявкам и отправляет уведомления при росте нарушений.",
    "acceptance_criteria": [
      "Считается SLA-нарушение по заданным правилам (реакция/решение) на основе данных тикетов",
      "Есть порог уведомлений (например, >10% нарушений за день) настраиваемый",
      "Генерируется ежедневный отчет по SLA с разбивкой по приоритетам",
      "Есть механизм отправки уведомлений (email/webhook) на тестовый приемник"
    ]
  },
  {
    "id": "hard-026",
    "title": "Сервис управления шаблонами ответов поддержки с согласованием",
    "description": "Сервис для хранения шаблонов ответов (макросов) поддержки: создание, согласование, публикация, версия.",
    "acceptance_criteria": [
      "Роли: автор, согласующий, читатель; согласующий может публиковать",
      "Шаблон имеет статус: 'черновик', 'на согласовании', 'опубликован'",
      "Есть версионирование шаблонов и возможность отката к предыдущей версии",
      "Есть поиск по шаблонам и фильтр по категории обращений"
    ]
  },
  {
    "id": "hard-027",
    "title": "Сервис оценки нагрузки поддержки: прогноз на неделю",
    "description": "Сервис, который по истории тикетов строит прогноз количества обращений на неделю по дням и категориям.",
    "acceptance_criteria": [
      "Импорт истории тикетов минимум за 8 недель (CSV)",
      "Прогноз строится на 7 дней вперед: всего и по топ-5 категориям",
      "Есть график факта и прогноза (в UI) и таблица значений",
      "Есть настройка 'праздничных дней' (вручную) и пересчет прогноза"
    ]
  },
  {
    "id": "hard-028",
    "title": "Сервис управления внутренними объявлениями и уведомлениями",
    "description": "Сервис для публикации объявлений внутри компании: сегменты получателей, расписание, подтверждение прочтения.",
    "acceptance_criteria": [
      "Можно создать объявление с сегментом (отдел/роль) и датой публикации",
      "Получатели видят список объявлений, могут отметить 'прочитано'",
      "Есть отчет по объявлению: % прочитавших и список непрочитавших",
      "Есть авто-снятие объявления после даты окончания"
    ]
  },
  {
    "id": "hard-029",
    "title": "Сервис подбора ноутбука/ПК под сценарий с объяснением выбора",
    "description": "Сервис подбора техники под сценарии (офис/монтаж/игры) с ранжированием, ограничениями и объяснимыми причинами.",
    "acceptance_criteria": [
      "Есть каталог минимум 50 устройств с параметрами (CPU/GPU/RAM/SSD/вес/цена)",
      "Пользователь задаёт сценарий, бюджет и ограничения (например, вес <= 1.7 кг)",
      "Сервис рассчитывает скоринг по сценариям и показывает топ-10 результатов",
      "Для каждого результата выводятся 2–3 причины (например, 'влезает в бюджет', 'высокая RAM', 'подходит по GPU')"
    ]
  },
  {
    "id": "hard-030",
    "title": "Сервис управления встречами: повестка, решения, задачи",
    "description": "Сервис для команд: подготовка повестки встречи, фиксация решений, формирование задач и контроль выполнения.",
    "acceptance_criteria": [
      "Можно создать встречу с повесткой (список пунктов) и участниками (простые записи)",
      "После встречи можно добавить решения и задачи с ответственными и сроком",
      "Есть список задач по пользователю и фильтр по статусу",
      "Есть отчет по встрече: решения + список задач со статусами"
    ]
  },

  {
    "id": "hard-031",
    "title": "Сервис сравнения онлайн-курсов с учетом расписания и времени",
    "description": "Сервис выбора курса по бюджету, занятости и дедлайну: учитывает нагрузку в часах в неделю и доступные окна времени.",
    "acceptance_criteria": [
      "Каталог минимум 100 курсов с ценой, длительностью, часами в неделю и форматом",
      "Пользователь задаёт бюджет, дедлайн (дата) и доступные часы в неделю",
      "Сервис фильтрует курсы по дедлайну и нагрузке и ранжирует по стоимости/релевантности",
      "Показывается топ-10 и предупреждение, если курс не помещается по времени"
    ]
  },
  {
    "id": "hard-032",
    "title": "Сервис оценки выгодности рефинансирования с учетом комиссий и страховок",
    "description": "Сервис рефинансирования: учитывает комиссии, страховки, разовые платежи и сравнивает несколько предложений банка.",
    "acceptance_criteria": [
      "Пользователь вводит параметры текущего кредита и минимум 3 новых предложения",
      "Сервис учитывает разовые платежи (комиссии) и регулярные (страховка) отдельно",
      "Для каждого предложения считает общую экономию/переплату и точку окупаемости (в месяцах)",
      "Выводится таблица сравнения и топ-1 рекомендация по максимальной экономии"
    ]
  },
  {
    "id": "hard-033",
    "title": "Сервис управления очередью на услуги (запись) для малого бизнеса",
    "description": "Сервис записи клиентов на услуги: слоты, мастера, подтверждение, отмены, список на день.",
    "acceptance_criteria": [
      "Роли: админ и сотрудник; админ создает услуги и расписание мастеров",
      "Клиент может выбрать услугу, мастера и слот времени и создать запись",
      "Есть отмена записи и освобождение слота",
      "Есть дневной список записей по мастерам и экспорт в CSV"
    ]
  },
  {
    "id": "hard-034",
    "title": "Сервис расчета эффективности рекламы: кампании, источники, ROI",
    "description": "Сервис учета рекламных кампаний: затраты, лиды, продажи, расчет ROI и сравнение источников.",
    "acceptance_criteria": [
      "CRUD кампаний с полями: источник, бюджет, период, конверсии",
      "Ввод факта: лиды, продажи, средний чек",
      "Сервис считает ROI и стоимость лида/продажи по кампании",
      "Есть рейтинг источников по ROI за период и выгрузка отчета в CSV"
    ]
  },
  {
    "id": "hard-035",
    "title": "Сервис «выбор формата работы» для команды: деньги + время + места",
    "description": "Сервис для руководителя: сравнение офис/гибрид/удалёнка с учетом стоимости рабочих мест, компенсаций, и количества мест в офисе.",
    "acceptance_criteria": [
      "Сценарии: офис, гибрид (настройка дней), удалёнка; параметры задаются в настройках",
      "Учитывается ограничение по местам в офисе (например, 30 мест на 50 сотрудников) и выводится предупреждение при нарушении",
      "Считаются ежемесячные затраты на команду и суммарные часы в дороге по сценарию",
      "Есть таблица сравнения сценариев и вывод 'допустим/недопустим' по ограничению мест"
    ]
  },
  {
    "id": "hard-036",
    "title": "Сервис учета и контроля KPI поддержки по неделям",
    "description": "Сервис расчета KPI поддержки: количество тикетов, среднее время ответа, среднее время решения, % SLA-нарушений, по неделям.",
    "acceptance_criteria": [
      "Импорт тикетов (создан, первый ответ, закрыт, приоритет, категория, оператор)",
      "Сервис считает метрики по неделям минимум за 8 недель",
      "Есть фильтры по категории и оператору",
      "Есть экран 'сводка KPI' и экспорт метрик в CSV"
    ]
  },
  {
    "id": "hard-037",
    "title": "Сервис управления инцидентами для клиентского продукта (постмортемы)",
    "description": "Сервис регистрации инцидентов (простои/ошибки), влияние на клиентов, статус устранения и постмортем-форма.",
    "acceptance_criteria": [
      "Можно создать инцидент с временем начала/окончания и оценкой затронутых пользователей",
      "Есть статусы: 'открыт', 'стабилизирован', 'закрыт' и ответственное лицо",
      "Для закрытого инцидента требуется заполнить форму постмортема (причина, меры, предотвращение)",
      "Есть отчет: суммарное время простоя и количество инцидентов по месяцам"
    ]
  },
  {
    "id": "hard-038",
    "title": "Сервис «умный FAQ» для продукта с версиями и аналитикой просмотров",
    "description": "Сервис FAQ: статьи, версии, теги, поиск, счетчики просмотров и наиболее полезные статьи.",
    "acceptance_criteria": [
      "CRUD статей с тегами и версионностью (минимум 2 версии статьи)",
      "Есть поиск по заголовку и тегам",
      "Сервис считает просмотры статей и показывает топ-10 по просмотрам",
      "Есть фильтр по версии продукта (например, v1/v2) и показ релевантных статей"
    ]
  },
  {
    "id": "hard-039",
    "title": "Сервис записи и контроля документов: сроки, статусы, напоминания",
    "description": "Сервис для пользователя: хранение списка важных документов (паспорт, страховка), сроков действия и напоминаний о продлении.",
    "acceptance_criteria": [
      "Можно добавить документ с датой окончания и типом документа",
      "Есть список документов, истекающих в ближайшие 30/60 дней",
      "Можно отметить документ как 'обновлен' с новой датой окончания, история сохраняется",
      "Есть механизм напоминаний (email/webhook) на тестовый адрес"
    ]
  },
  {
    "id": "hard-040",
    "title": "Сервис «калькулятор решений» для бытовых выборов с сохранением сценариев",
    "description": "Сервис, где пользователь сравнивает варианты (например, аренда vs ипотека, доставка vs магазин) по нескольким показателям и сохраняет сценарии для повторного использования.",
    "acceptance_criteria": [
      "Пользователь может создать минимум 3 типа сравнений (шаблоны) с разными полями ввода",
      "В каждом сравнении есть минимум 2 варианта и минимум 2 метрики результата (деньги и время)",
      "Пользователь может сохранять сценарии и возвращаться к ним (история минимум 10 сценариев)",
      "Есть экспорт результатов сценария в PDF или CSV"
    ]
  }
]
