[
  {
    "id": "easy-001",
    "title": "Сервис выбора ипотечной программы под сценарии жизни",
    "description": "Сервис, который помогает пользователю выбрать ипотеку, сравнивая несколько банков под разные жизненные сценарии: минимальный платёж, минимальная переплата, быстрый досрочный выход.",
    "acceptance_criteria": [
      "Пользователь вводит сумму кредита и срок",
      "Есть минимум 3 банка с заранее заданными ставками и условиями",
      "Есть минимум 3 сценария сравнения (минимальный платеж, минимальная переплата, досрочное погашение)",
      "Результат выводится таблицей с платежом, переплатой и выбранным лучшим вариантом по каждому сценарию"
    ]
  },
  {
    "id": "easy-002",
    "title": "Менеджер подписок с оптимизацией бюджета и «планом отключений»",
    "description": "Сервис учета подписок, который помогает уложиться в месячный лимит: предлагает план отключений/понижений тарифов и показывает экономию по шагам.",
    "acceptance_criteria": [
      "Можно добавить минимум 10 подписок с полями: цена, периодичность, важность (1–5), возможность понижения тарифа (да/нет)",
      "Пользователь задаёт месячный лимит расходов на подписки",
      "Сервис строит план оптимизации: какие подписки отключить/понизить в первую, вторую и третью очередь",
      "Показывается итоговая сумма до/после и экономия после каждого шага оптимизации"
    ]
  },
  {
    "id": "easy-003",
    "title": "Сравнение аренды и ипотеки на горизонте нескольких лет",
    "description": "Сервис сравнения финансовых последствий аренды и ипотеки на выбранном горизонте времени, с учетом роста аренды и переплаты по кредиту.",
    "acceptance_criteria": [
      "Пользователь задаёт срок сравнения (например, 5 или 10 лет)",
      "Для аренды учитывается ежегодный рост в процентах",
      "Для ипотеки рассчитывается переплата и суммарные выплаты",
      "Выводятся две итоговые суммы и разница между ними"
    ]
  },
  {
    "id": "easy-004",
    "title": "Сервис выбора банковской карты под структуру расходов",
    "description": "Сервис, который рекомендует банковскую карту на основе структуры расходов пользователя и условий кэшбэка.",
    "acceptance_criteria": [
      "Пользователь вводит расходы минимум по 5 категориям",
      "Есть минимум 3 карты с разными правилами начисления кэшбэка и лимитами",
      "Для каждой карты рассчитывается ожидаемый кэшбэк и чистая выгода (кэшбэк минус стоимость обслуживания)",
      "Карты сортируются по чистой выгоде, показывается топ-1 рекомендация"
    ]
  },
  {
    "id": "easy-005",
    "title": "Планировщик накоплений с несколькими целями",
    "description": "Сервис планирования накоплений на несколько целей с ограниченным месячным бюджетом и проверкой достижимости целей в срок.",
    "acceptance_criteria": [
      "Можно создать минимум 3 цели с суммой и сроком",
      "Пользователь задаёт общий месячный бюджет",
      "Сервис распределяет бюджет по целям по правилам (по сроку/по приоритету)",
      "Для каждой цели выводится статус: 'успеваем' или 'не успеваем' и дефицит/профицит суммы"
    ]
  },
  {
    "id": "easy-006",
    "title": "Сервис оценки выгодности доставки продуктов",
    "description": "Сервис сравнения доставки продуктов и похода в магазин с учетом стоимости времени пользователя и вероятности импульсных покупок.",
    "acceptance_criteria": [
      "Пользователь вводит средний чек, стоимость доставки и время на поход в магазин (в часах)",
      "Пользователь вводит стоимость часа времени и процент импульсных покупок в магазине",
      "Сервис считает итоговую стоимость двух сценариев: доставка и магазин",
      "Выводится таблица сравнения и рекомендация, какой сценарий дешевле"
    ]
  },
  {
    "id": "easy-007",
    "title": "Менеджер бытовых платежей с прогнозом на месяц",
    "description": "Сервис учета регулярных бытовых платежей с историей и прогнозом суммы на следующий месяц по каждому типу платежа.",
    "acceptance_criteria": [
      "Можно добавить минимум 5 типов платежей (ЖКХ, интернет, мобильная связь и т.д.)",
      "По каждому платежу хранится история минимум из 3 записей",
      "Прогноз следующего месяца рассчитывается как среднее последних 3 значений по каждому типу",
      "Показывается прогноз по типам и общий итог на следующий месяц"
    ]
  },

  {
    "id": "easy-008",
    "title": "Планировщик отпускного бюджета по категориям",
    "description": "Сервис, который помогает разложить бюджет отпуска по категориям и проверить, укладывается ли пользователь в лимит.",
    "acceptance_criteria": [
      "Пользователь вводит общий бюджет отпуска и длительность (дни)",
      "Есть минимум 6 категорий расходов с возможностью задать план",
      "Сервис показывает остаток бюджета и бюджет в день",
      "Категории сортируются по доле в бюджете"
    ]
  },
  {
    "id": "easy-009",
    "title": "Сервис выбора тарифа мобильной связи под профиль использования",
    "description": "Сервис, который подбирает тариф по вводимым параметрам: минуты, интернет, роуминг, доп. симки.",
    "acceptance_criteria": [
      "Пользователь вводит потребление: минуты/ГБ/смс и роуминг (да/нет)",
      "Есть минимум 5 тарифов с ограничениями и ценами",
      "Сервис считает переплату за превышения (если есть) и итоговую стоимость",
      "Тарифы сортируются по итоговой стоимости и показывается топ-3"
    ]
  },
  {
    "id": "easy-010",
    "title": "Сравнение способов покупки техники: сразу, рассрочка, кредит",
    "description": "Сервис сравнения 3 способов оплаты покупки техники по итоговой стоимости и нагрузке на бюджет.",
    "acceptance_criteria": [
      "Пользователь вводит цену товара и срок (месяцы)",
      "Есть 3 сценария: оплата сразу, рассрочка с комиссией, кредит со ставкой",
      "Для каждого сценария считается итоговая сумма выплат и ежемесячный платеж",
      "Результаты выводятся таблицей, лучший сценарий помечается"
    ]
  },
  {
    "id": "easy-011",
    "title": "Планировщик ежемесячного бюджета с лимитами по категориям",
    "description": "Сервис, где пользователь задает доход и лимиты по категориям, а затем вносит расходы и видит превышения.",
    "acceptance_criteria": [
      "Можно задать минимум 8 категорий с лимитами",
      "Можно добавлять расходы с датой, категорией и суммой",
      "Сервис подсвечивает категории, где лимит превышен",
      "Показывается общий остаток бюджета и топ-3 категорий по расходам"
    ]
  },
  {
    "id": "easy-012",
    "title": "Сервис планирования крупной покупки с вариантами финансирования",
    "description": "Сервис, который показывает 2–3 варианта достижения цели: накопить, кредит, смешанный вариант.",
    "acceptance_criteria": [
      "Пользователь вводит стоимость покупки, срок, доступный ежемесячный взнос",
      "Сервис предлагает минимум 3 стратегии (накопление, кредит, смешанная)",
      "Для каждой стратегии показываются сроки и итоговая стоимость",
      "Стратегии выводятся сравнительной таблицей"
    ]
  },
  {
    "id": "easy-013",
    "title": "Сервис выбора страховки: ОСАГО/КАСКО по сценарию использования",
    "description": "Сервис, который сравнивает страховые варианты по стоимости и покрытию в зависимости от сценария (город, трасса, новичок).",
    "acceptance_criteria": [
      "Пользователь выбирает один из 3 сценариев использования",
      "Есть минимум 4 страховых пакета с ценой и покрытием",
      "Сервис выводит сравнение: цена, франшиза, ключевые риски",
      "Показывается рекомендуемый пакет для выбранного сценария"
    ]
  },
  {
    "id": "easy-014",
    "title": "Сервис сравнения цен на доставку посылок",
    "description": "Сервис, который сравнивает стоимость доставки посылки у разных провайдеров по весу, габаритам и срокам.",
    "acceptance_criteria": [
      "Поля ввода: вес, габариты, город отправки и получения, желаемый срок",
      "Есть минимум 4 провайдера с разными тарифными правилами",
      "Сервис рассчитывает итоговую стоимость для каждого провайдера",
      "Результаты сортируются по цене и показывают срок доставки"
    ]
  },
  {
    "id": "easy-015",
    "title": "Сервис выбора интернет-провайдера по требованиям",
    "description": "Сервис подбора тарифа домашнего интернета по скорости, цене и наличию ТВ/моб.связи.",
    "acceptance_criteria": [
      "Пользователь задаёт требования: скорость, бюджет, ТВ (да/нет)",
      "Есть минимум 6 тарифов разных провайдеров",
      "Сервис фильтрует неподходящие тарифы и сортирует оставшиеся по цене",
      "Показывается топ-3 с ключевыми параметрами"
    ]
  },

  {
    "id": "easy-016",
    "title": "Трекер домашних лекарств и сроков годности",
    "description": "Сервис учета домашней аптечки, который предупреждает о скором истечении срока годности и формирует список покупок.",
    "acceptance_criteria": [
      "Можно добавить лекарство с дозировкой, количеством и датой годности",
      "Есть список 'истекает в ближайшие 30 дней'",
      "Можно пометить лекарство как 'закончилось'",
      "Формируется список покупок из помеченных 'закончилось'"
    ]
  },
  {
    "id": "easy-017",
    "title": "Сервис планирования питания на неделю с корзиной покупок",
    "description": "Сервис, где пользователь выбирает блюда на неделю и получает список продуктов с суммарными количествами.",
    "acceptance_criteria": [
      "Есть каталог минимум из 20 блюд с ингредиентами",
      "Пользователь выбирает блюда на 7 дней",
      "Сервис формирует агрегированный список продуктов с количествами",
      "Есть возможность исключить продукт (аллергия) и пересчитать корзину"
    ]
  },
  {
    "id": "easy-018",
    "title": "Сервис подбора фитнес-абонемента по частоте посещений",
    "description": "Сервис сравнивает 3 типа абонементов и показывает стоимость одного посещения в зависимости от реальной частоты.",
    "acceptance_criteria": [
      "Пользователь вводит предполагаемое число посещений в месяц",
      "Есть минимум 3 типа абонемента с ценами и ограничениями",
      "Сервис считает стоимость одного посещения для каждого варианта",
      "Результаты сортируются по стоимости одного посещения"
    ]
  },
  {
    "id": "easy-019",
    "title": "Сервис выбора онлайн-курса по цели и бюджету",
    "description": "Сервис, который помогает выбрать курс по заданной цели (например, аналитика/менеджмент) и бюджету, сравнивая длительность, цену и формат.",
    "acceptance_criteria": [
      "Пользователь выбирает цель и бюджет",
      "Есть минимум 10 курсов с тегами цели, ценой, длительностью, форматом",
      "Сервис фильтрует по цели и бюджету и сортирует по длительности/цене",
      "Показывается топ-5 результатов с ключевыми параметрами"
    ]
  },
  {
    "id": "easy-020",
    "title": "Сервис планирования командировки с лимитами",
    "description": "Сервис, где пользователь задает лимиты на транспорт/жильё/питание и вводит реальные расходы, чтобы контролировать превышения.",
    "acceptance_criteria": [
      "Можно задать лимиты минимум по 5 категориям",
      "Можно добавлять расходы с датой и категорией",
      "Сервис показывает превышения по категориям",
      "Есть итоговый отчет: план/факт по всем категориям"
    ]
  },

  {
    "id": "easy-021",
    "title": "Сервис выбора банка для вклада с учётом капитализации",
    "description": "Сервис сравнивает вклады по итоговой доходности с учетом капитализации и срока.",
    "acceptance_criteria": [
      "Поля ввода: сумма вклада и срок",
      "Есть минимум 5 вкладов с разными ставками и капитализацией (да/нет)",
      "Сервис считает итоговую сумму на конец срока для каждого вклада",
      "Результаты сортируются по итоговой сумме и показывают топ-3"
    ]
  },
  {
    "id": "easy-022",
    "title": "Сервис выбора маршрута на работу по стоимости и времени",
    "description": "Сервис сравнивает 3 способа добраться: общественный транспорт, такси, личный авто, с учетом времени и денег.",
    "acceptance_criteria": [
      "Пользователь вводит время в пути и стоимость для 3 способов",
      "Пользователь задаёт стоимость часа своего времени",
      "Сервис считает 'полную стоимость' = деньги + (время * стоимость часа)",
      "Выводится таблица и рекомендация по минимальной полной стоимости"
    ]
  },
  {
    "id": "easy-023",
    "title": "Трекер заявок в ИТ-поддержку с категориями и статусовкой",
    "description": "Сервис для регистрации заявок от пользователей с категоризацией (доступы, ПО, оборудование) и статусами обработки.",
    "acceptance_criteria": [
      "Можно создать заявку с категорией, описанием и приоритетом (низкий/средний/высокий)",
      "Есть статусы: 'новая', 'в работе', 'ожидает пользователя', 'закрыта'",
      "Есть фильтр по категории и статусу",
      "В списке заявок отображается дата создания и текущий статус"
    ]
  },
  {
    "id": "easy-024",
    "title": "Сервис контроля SLA по заявкам поддержки",
    "description": "Сервис, который считает соблюдение SLA реакции и решения по заявкам и показывает нарушения.",
    "acceptance_criteria": [
      "Для заявки фиксируются время создания, время первого ответа, время закрытия",
      "Есть SLA-правила по приоритетам (например, P1: ответ 30 мин, решение 4 часа)",
      "Сервис помечает заявки как 'SLA OK' или 'SLA нарушен' отдельно для ответа и решения",
      "Есть отчет: количество нарушений по приоритетам за выбранный период"
    ]
  },
  {
    "id": "easy-025",
    "title": "Сервис выдачи и учета оборудования сотрудникам",
    "description": "Сервис учета выдачи ноутбуков/мониторов/токенов сотрудникам с историей движений.",
    "acceptance_criteria": [
      "Можно создать карточку оборудования с инвентарным номером и типом",
      "Можно 'выдать' оборудование сотруднику и 'вернуть' обратно",
      "Хранится история операций по каждому предмету оборудования",
      "Есть список оборудования со статусом: 'на складе' или 'выдано'"
    ]
  },

  {
    "id": "easy-026",
    "title": "Сервис учета обращений клиентов (мини-CRM) для малого бизнеса",
    "description": "Сервис для фиксации обращений клиентов с источником (чат/телефон/почта) и результатом обработки.",
    "acceptance_criteria": [
      "Можно добавить обращение с клиентом, источником, темой и статусом",
      "Есть статусы: 'новое', 'в работе', 'решено', 'закрыто без решения'",
      "Есть фильтр по источнику и статусу",
      "Показывается отчет: сколько обращений в каждом статусе"
    ]
  },
  {
    "id": "easy-027",
    "title": "Сервис расчета стоимости простоя сервиса для бизнеса",
    "description": "Сервис, который считает потери от простоя с учетом выручки в час и количества затронутых пользователей.",
    "acceptance_criteria": [
      "Поля ввода: длительность простоя (часы), выручка в час, число затронутых пользователей",
      "Сервис рассчитывает прямые потери (выручка * часы)",
      "Сервис рассчитывает 'потери на пользователя' (прямые потери / пользователей)",
      "Результаты выводятся таблицей из 3 строк: прямые потери, потери на пользователя, итог"
    ]
  },
  {
    "id": "easy-028",
    "title": "Сервис выбора места для аренды офиса под требования",
    "description": "Сервис, который сравнивает варианты аренды офиса по бюджету, метро, площади и включенным услугам.",
    "acceptance_criteria": [
      "Пользователь задаёт требования: бюджет, площадь, максимум минут до метро",
      "Есть минимум 8 вариантов офисов с параметрами и доп.платежами",
      "Сервис фильтрует неподходящие варианты и считает итоговую стоимость (аренда + доп.платежи)",
      "Результаты сортируются по итоговой стоимости и показывают топ-5"
    ]
  },
  {
    "id": "easy-029",
    "title": "Сервис выбора ноутбука по сценарию использования",
    "description": "Сервис, который подбирает ноутбук по сценарию (работа/учёба/игры) с учетом бюджета и веса.",
    "acceptance_criteria": [
      "Пользователь выбирает сценарий и бюджет, задаёт максимум веса",
      "Есть минимум 12 моделей с параметрами (цена, вес, память, процессор, видеокарта)",
      "Сервис фильтрует и ранжирует модели по заранее заданному скорингу для выбранного сценария",
      "Показывается топ-5 моделей с причинами попадания в топ (по 2 критерия)"
    ]
  },
  {
    "id": "easy-030",
    "title": "Сервис планирования расходов на ремонт с этапами",
    "description": "Сервис, который разбивает ремонт на этапы (черновые, чистовые, мебель) и контролирует бюджет по этапам.",
    "acceptance_criteria": [
      "Есть минимум 5 этапов ремонта с плановыми бюджетами",
      "Можно добавлять фактические траты с привязкой к этапу",
      "Сервис показывает план/факт и превышение по каждому этапу",
      "Есть общий итог и топ-3 самых затратных статей"
    ]
  },

  {
    "id": "easy-031",
    "title": "Сервис сравнения тарифов эквайринга для малого бизнеса",
    "description": "Сервис, который считает итоговую комиссию эквайринга по обороту и среднему чеку для нескольких провайдеров.",
    "acceptance_criteria": [
      "Поля ввода: месячный оборот и средний чек",
      "Есть минимум 4 провайдера с разными ставками и минимальными платежами",
      "Сервис считает итоговые комиссии за месяц для каждого провайдера",
      "Результаты сортируются по итоговой комиссии и показывают топ-3"
    ]
  },
  {
    "id": "easy-032",
    "title": "Сервис подбора графика платежей по цели и доходу",
    "description": "Сервис, который помогает пользователю выбрать график платежей (раз в месяц/раз в неделю) для достижения финансовой цели.",
    "acceptance_criteria": [
      "Пользователь вводит цель (сумма) и срок (недели/месяцы)",
      "Есть минимум 3 варианта графика взносов",
      "Для каждого варианта считается размер взноса и дата достижения цели",
      "Результат выводится таблицей с вариантами и рекомендацией минимального взноса"
    ]
  },
  {
    "id": "easy-033",
    "title": "Сервис планирования покупок продуктов с ограничением бюджета",
    "description": "Сервис, где пользователь набирает продукты из каталога и видит, укладывается ли в бюджет; при превышении предлагает, что убрать.",
    "acceptance_criteria": [
      "Есть каталог минимум из 30 продуктов с ценой и категорией",
      "Пользователь задаёт бюджет и набирает корзину",
      "Сервис показывает превышение бюджета (если есть)",
      "Если бюджет превышен, сервис предлагает список из минимум 3 позиций для удаления с максимальным эффектом на бюджет"
    ]
  },
  {
    "id": "easy-034",
    "title": "Сервис учета и анализа времени работы по задачам",
    "description": "Сервис, в котором сотрудник фиксирует время по задачам и получает отчет по распределению времени за неделю.",
    "acceptance_criteria": [
      "Можно добавить задачу и затраченное время (часы) с датой",
      "Есть отчет по неделе: сумма часов по каждой задаче",
      "Задачи сортируются по убыванию затраченного времени",
      "Показывается топ-3 задачи по времени и общий итог за неделю"
    ]
  },
  {
    "id": "easy-035",
    "title": "Сервис выбора формата работы для команды по затратам и загрузке",
    "description": "Сервис, который помогает руководителю выбрать формат работы команды (офис, гибрид, удалёнка) на основе затрат компании и загрузки сотрудников.",
    "acceptance_criteria": [
      "Есть минимум 3 сценария: офис, гибрид (2–3 дня), удалёнка",
      "Для каждого сценария задаются параметры: аренда рабочего места, компенсации, среднее время дороги",
      "Сервис считает для каждого сценария: ежемесячные затраты на сотрудника и потерю времени в часах",
      "Результат выводится в таблице с итогами по каждому сценарию и пометкой минимального по затратам"
    ]
  },

  {
    "id": "easy-036",
    "title": "Сервис оценки качества обработки обращений поддержки по чек-листу",
    "description": "Сервис, где руководитель поддержки оценивает качество ответов по чек-листу и получает рейтинг операторов.",
    "acceptance_criteria": [
      "Есть чек-лист минимум из 6 критериев (тон, полнота, срок, решение, уточняющие вопросы, следующий шаг)",
      "Можно добавить оценку обращения и привязать к оператору",
      "Сервис считает средний балл по оператору за период",
      "Показывается рейтинг операторов (топ-10) с количеством оцененных обращений"
    ]
  },
  {
    "id": "easy-037",
    "title": "Сервис планирования графика дежурств с проверкой конфликтов",
    "description": "Сервис составления расписания дежурств команды на месяц с проверкой конфликтов и ограничений.",
    "acceptance_criteria": [
      "Можно задать список сотрудников и ограничения (не более N дежурств, недоступные дни)",
      "Можно сформировать расписание на месяц",
      "Сервис проверяет конфликты (дежурство в недоступный день, превышение лимита) и показывает список ошибок",
      "Есть просмотр расписания в виде календаря или таблицы"
    ]
  },
  {
    "id": "easy-038",
    "title": "Сервис подбора вакансии по требованиям кандидата",
    "description": "Сервис, который фильтрует и ранжирует вакансии по навыкам, зарплате, формату работы и уровню.",
    "acceptance_criteria": [
      "Есть база минимум из 30 вакансий с полями: зарплата, формат (офис/удалёнка), навыки, уровень",
      "Пользователь выбирает минимум 5 навыков и желаемую зарплату",
      "Сервис считает 'процент совпадения' по навыкам и ранжирует вакансии",
      "Показывается топ-10 вакансий с процентом совпадения"
    ]
  },
  {
    "id": "easy-039",
    "title": "Сервис учета и контроля KPI команды поддержки",
    "description": "Сервис, который считает KPI поддержки (кол-во заявок, среднее время ответа, доля SLA-нарушений) по неделям.",
    "acceptance_criteria": [
      "Есть загрузка/ввод данных по заявкам (создана, первый ответ, закрыта, приоритет)",
      "Сервис считает среднее время первого ответа и закрытия за неделю",
      "Сервис считает долю SLA-нарушений за неделю",
      "Показывается сводная таблица KPI по неделям минимум за 4 недели"
    ]
  },
  {
    "id": "easy-040",
    "title": "Сервис «что отключить/заменить», чтобы сократить расходы на 10–30%",
    "description": "Сервис оптимизации личных регулярных расходов (подписки, связь, интернет, доставка), который предлагает план сокращения расходов на заданный процент.",
    "acceptance_criteria": [
      "Пользователь добавляет регулярные расходы минимум по 4 категориям и указывает 'важность' (1–5)",
      "Пользователь задаёт цель экономии (например, 15%)",
      "Сервис предлагает план действий минимум из 5 шагов с ожидаемой экономией по шагам",
      "Показывается итог: достигнута ли цель экономии и на сколько процентов"
    ]
  }
]
